benchmark_result/bench_result_hadware_evol/fio/xen_4_12_0/vm7/fio_result/round3/rand_read_throughput
rand_read_throughput: (g=0): rw=randread, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=64
...
fio-3.1
Starting 4 processes

rand_read_throughput: (groupid=0, jobs=4): err= 0: pid=17405: Fri Jun 21 09:06:08 2024
   read: IOPS=2004, BW=2009MiB/s (2106MB/s)(118GiB/60014msec)
    slat (usec): min=77, max=44280, avg=1743.80, stdev=3456.37
    clat (usec): min=778, max=493647, avg=125722.57, stdev=61269.90
     lat (usec): min=863, max=496641, avg=127518.35, stdev=61812.76
    clat percentiles (msec):
     |  1.00th=[   37],  5.00th=[   41], 10.00th=[   52], 20.00th=[   74],
     | 30.00th=[   89], 40.00th=[  105], 50.00th=[  118], 60.00th=[  133],
     | 70.00th=[  150], 80.00th=[  171], 90.00th=[  205], 95.00th=[  239],
     | 99.00th=[  317], 99.50th=[  351], 99.90th=[  430], 99.95th=[  447],
     | 99.99th=[  472]
   bw (  KiB/s): min=181441, max=1438914, per=25.11%, avg=516596.15, stdev=180103.43, samples=479
   iops        : min=  177, max= 1405, avg=504.15, stdev=175.84, samples=479
  lat (usec)   : 1000=0.01%
  lat (msec)   : 4=0.01%, 10=0.01%, 20=0.02%, 50=9.35%, 100=28.05%
  lat (msec)   : 250=58.94%, 500=3.83%
  cpu          : usr=6.00%, sys=39.88%, ctx=48002, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=103.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=120305,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=2009MiB/s (2106MB/s), 2009MiB/s-2009MiB/s (2106MB/s-2106MB/s), io=118GiB (126GB), run=60014-60014msec

Disk stats (read/write):
  xvda: ios=992994/12, merge=0/11, ticks=883576/8, in_queue=801244, util=98.76%